{
  "action_dim": 32,
  "action_length": 30,
  "architectures": [
    "MiBoTForActionGeneration"
  ],
  "auto_map": {
    "AutoConfig": "configuration_mibot.MiBoTConfig",
    "AutoModel": "modeling_mibot.MiBoTForActionGeneration"
  },
  "dit_config": {
    "dtype": "float32",
    "head_dim": 128,
    "hidden_size": 1024,
    "model_type": "dit",
    "num_hidden_layers": 16,
    "num_key_value_heads": 8
  },
  "dtype": "bfloat16",
  "model_type": "mibot",
  "state_dim": 32,
  "state_length": 1,
  "transformers_version": "4.57.1",
  "vlm_config": {
    "_name_or_path": "Qwen/Qwen3-VL-4B-Instruct",
    "architectures": [
      "Qwen3VLForConditionalGeneration"
    ],
    "dtype": "float32",
    "image_token_id": 151655,
    "model_type": "qwen3_vl",
    "text_config": {
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "attention_bias": false,
      "attention_dropout": 0.0,
      "bad_words_ids": null,
      "begin_suppress_tokens": null,
      "bos_token_id": 151643,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "diversity_penalty": 0.0,
      "do_sample": false,
      "dtype": "bfloat16",
      "early_stopping": false,
      "encoder_no_repeat_ngram_size": 0,
      "eos_token_id": 151645,
      "exponential_decay_length_penalty": null,
      "finetuning_task": null,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "head_dim": 128,
      "hidden_act": "silu",
      "hidden_size": 2560,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "initializer_range": 0.02,
      "intermediate_size": 9728,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "length_penalty": 1.0,
      "max_length": 20,
      "max_position_embeddings": 262144,
      "min_length": 0,
      "model_type": "qwen3_vl_text",
      "no_repeat_ngram_size": 0,
      "num_attention_heads": 32,
      "num_beam_groups": 1,
      "num_beams": 1,
      "num_hidden_layers": 36,
      "num_key_value_heads": 8,
      "num_return_sequences": 1,
      "output_attentions": false,
      "output_hidden_states": false,
      "output_scores": false,
      "pad_token_id": null,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "remove_invalid_values": false,
      "repetition_penalty": 1.0,
      "return_dict": true,
      "return_dict_in_generate": false,
      "rms_norm_eps": 1e-06,
      "rope_scaling": {
        "mrope_interleaved": true,
        "mrope_section": [
          24,
          20,
          20
        ],
        "rope_type": "default"
      },
      "rope_theta": 5000000,
      "sep_token_id": null,
      "suppress_tokens": null,
      "task_specific_params": null,
      "temperature": 1.0,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "top_k": 50,
      "top_p": 1.0,
      "torchscript": false,
      "typical_p": 1.0,
      "use_bfloat16": false,
      "use_cache": true,
      "vocab_size": 151936
    },
    "tie_word_embeddings": true,
    "video_token_id": 151656,
    "vision_config": {
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "bad_words_ids": null,
      "begin_suppress_tokens": null,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "deepstack_visual_indexes": [
        5,
        11,
        17
      ],
      "depth": 24,
      "diversity_penalty": 0.0,
      "do_sample": false,
      "dtype": null,
      "early_stopping": false,
      "encoder_no_repeat_ngram_size": 0,
      "eos_token_id": null,
      "exponential_decay_length_penalty": null,
      "finetuning_task": null,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "hidden_act": "gelu_pytorch_tanh",
      "hidden_size": 1024,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "in_channels": 3,
      "initializer_range": 0.02,
      "intermediate_size": 4096,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "length_penalty": 1.0,
      "max_length": 20,
      "min_length": 0,
      "model_type": "qwen3_vl",
      "no_repeat_ngram_size": 0,
      "num_beam_groups": 1,
      "num_beams": 1,
      "num_heads": 16,
      "num_position_embeddings": 2304,
      "num_return_sequences": 1,
      "out_hidden_size": 2560,
      "output_attentions": false,
      "output_hidden_states": false,
      "output_scores": false,
      "pad_token_id": null,
      "patch_size": 16,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "remove_invalid_values": false,
      "repetition_penalty": 1.0,
      "return_dict": true,
      "return_dict_in_generate": false,
      "sep_token_id": null,
      "spatial_merge_size": 2,
      "suppress_tokens": null,
      "task_specific_params": null,
      "temperature": 1.0,
      "temporal_patch_size": 2,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "top_k": 50,
      "top_p": 1.0,
      "torchscript": false,
      "typical_p": 1.0,
      "use_bfloat16": false
    },
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652
  }
}
